Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir.Direction
The direction of the RebarShapeSegment in UV-space.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2012